Revit 2024 API
Floor.GetSpanDirectionSymbolIds Method
Retrieves span direction symbol ElementIds.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public ICollection<ElementId> GetSpanDirectionSymbolIds()
Visual Basic
Public Function GetSpanDirectionSymbolIds As ICollection(Of ElementId)
Visual C++
public:
ICollection<ElementId^>^ GetSpanDirectionSymbolIds()
Return Value
A collection of Element Ids of span direction symbol elements
Remarks
The element types of the Ids of these symbols determine if the floor has one way or two way span direction graphics.
See Also
Floor Class
Autodesk.Revit.DB Namespace